Script started on 2020-02-06 11:57:55-05:00 [TERM="xterm-256color" TTY="/dev/pts/2" COLUMNS="80" LINES="24"]
bash: /home/umrigar/cs240/bin/student.rc: Permission denied
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2$ ls
1-hello  2-hello  3-overload  lab2.LOG	Makefile
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2$ cd [K/[K[K[Kls
1-hello  2-hello  3-overload  lab2.LOG	Makefile
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2$ cd 1-hello/
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/1-hello$ ls
hello.cc  Makefile  README
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/1-hello$ ls -l
total 12
-rw-r--r-- 1 bmarti38 bmarti38 363 Feb  6 11:50 hello.cc
-rw-r--r-- 1 bmarti38 bmarti38  39 Feb  6 11:50 Makefile
-rw-r--r-- 1 bmarti38 bmarti38  61 Feb  6 11:50 README
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/1-hello$ re[K[Kgedit r[KREADME 
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/1-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/1-hello$ ./hello
usage: ./hello NAME...
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/1-hello$ he[K[K./hello b art lisa
hello bart
hello lisa
hello bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/1-hello$ gdb hello [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Ko
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start bart lisa
Temporary breakpoint 1 at 0x11cd: file hello.cc, line 13.
Starting program: /import/linux/home1/bmarti38/i240a/submit/lab2/1-hello/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe768) at hello.cc:13
13	  if (argc == 1) {
(gdb) l
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
14	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
15	    std::exit(1);
16	  }
17	  else {
(gdb) say[K[K[Kb sayHello
Breakpoint 2 at 0x555555555181: file hello.cc, line 7.
(gdb) say hello[K[K[K[K[K[K[K[K[Ksay h[K[K[K[K[Kp argc
$1 = 3
(gdb) pa rgv[K[K[K[K[K argv
$2 = (const char **) 0x7fffffffe768
(gdb) p argv[0]
$3 = 0x7fffffffea5e "/import/linux/home1/bmarti38/i240a/submit/lab2/1-hello/hello"
(gdb) p arv[Kgv [1]
$4 = 0x7fffffffea9b "bart"
(gdb) *arg@3
Undefined command: "".  Try "help".
(gdb) n
18	    for (int i = 1; i <= argc; i++) {
(gdb) n
19	      sayHello(argv[i]);
(gdb) c. say[K[K[K[KsayHello()
Not stopped at any breakpoint; argument ignored.
Continuing.

Breakpoint 2, sayHello (name=0x7fffffffea9b "bart") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) up
#1  0x0000555555555257 in main (argc=3, argv=0x7fffffffe768) at hello.cc:19
19	      sayHello(argv[i]);
(gdb) down[K[K[K[Kdown
#0  sayHello (name=0x7fffffffea9b "bart") at hello.cc:7
7	  std::cout << "hello " << name << std::endl;
(gdb) c [K.sayHello()
A syntax error in expression, near `.sayHello()'.
(gdb) c.sayHello()
A syntax error in expression, near `.sayHello()'.
(gdb) c. sayHello()
A syntax error in expression, near `. sayHello()'.
(gdb) c say he[K[K[KHello()
Too few arguments in function call.
(gdb) q
A debugging session is active.

	Inferior 1 [process 10660] will be killed.

Quit anyway? (y or n) y
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/1-hello$ gedit hello.cc

(gedit:13472): Gtk-[1;33mWARNING[0m **: [34m12:20:36.838[0m: Calling org.xfce.Session.Manager.Inhibit failed: GDBus.Error:org.freedesktop.DBus.Error.UnknownMethod: Method "Inhibit" with signature "susu" on interface "org.xfce.Session.Manager" doesn't exist

bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/1-hello$ make 
g++ -g -Wall -std=c++17    hello.cc   -o hello
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/1-hello$ ./hello
usage: ./hello NAME...
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/1-hello$ ./hello l isa[K[K[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cb art lisa
hello bart
hello lisa
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/1-hello$ cd ..
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2$ s[Kcd 2-hello/
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/2-hello$ make
g++ -g -Wall -std=c++17    hello.cc   -o hello
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/2-hello$ ./hello l isa ab[K[Kbart
Hello Lisa
Hello Bart
Segmentation fault
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/2-hello$ ./hello l isa[K[K[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K ' lisa sims[Kpson' 'bar [Kt si,[Kmpson'
Hello Lisa Simpson9V
Hello Bart Simpson9V
Segmentation fault
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/2-hello$ gdb hello [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Ko
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) starrt[K[Kt bart lisa
Temporary breakpoint 1 at 0x12e1: file hello.cc, line 36.
Starting program: /import/linux/home1/bmarti38/i240a/submit/lab2/2-hello/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe768) at hello.cc:36
36	  if (argc == 1) {
(gdb) down
Bottom (innermost) frame selected; you cannot go down.
(gdb) up
Initial frame selected; you cannot go up.
(gdb) q
A debugging session is active.

	Inferior 1 [process 14433] will be killed.

Quit anyway? (y or n) y
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/2-hello$ gedit hello.cc
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/2-hello$ gdc [K[Ks[Kc[Kb hekk[K[Kllo [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Ko
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start bart lisa [K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[Kc[Kc s[Kf [K(
Display all 200 possibilities? (y or n)
(gdb) c f([K[K[K[Kstart
Temporary breakpoint 1 at 0x12e1: file hello.cc, line 36.
Starting program: /import/linux/home1/bmarti38/i240a/submit/lab2/2-hello/hello 

Temporary breakpoint 1, main (argc=1, argv=0x7fffffffe788) at hello.cc:36
36	  if (argc == 1) {
(gdb) n
37	    std::cerr << "usage: " << argv[0] << " NAME..." << std::endl;
(gdb) n
usage: /import/linux/home1/bmarti38/i240a/submit/lab2/2-hello/hello NAME...
38	    std::exit(1);
(gdb) n
[Inferior 1 (process 14993) exited with code 01]
(gdb) 
The program is not being run.
(gdb) q
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/2-hello$ gedit hel lo

(gedit:15508): GLib-GObject-[1;33mWARNING[0m **: [34m12:30:21.061[0m: invalid unclassed pointer in cast to 'GeditOpenDocumentSelector'

(gedit:15508): Gtk-[1;35mCRITICAL[0m **: [34m12:30:21.061[0m: gtk_list_store_clear: assertion 'GTK_IS_LIST_STORE (list_store)' failed

(gedit:15508): Gtk-[1;35mCRITICAL[0m **: [34m12:30:21.061[0m: gtk_widget_set_visible: assertion 'GTK_IS_WIDGET (widget)' failed

(gedit:15508): Gtk-[1;35mCRITICAL[0m **: [34m12:30:21.061[0m: gtk_widget_set_visible: assertion 'GTK_IS_WIDGET (widget)' failed

(gedit:15508): GLib-GObject-[1;33mWARNING[0m **: [34m12:30:21.061[0m: invalid unclassed pointer in cast to 'GeditOpenDocumentSelector'

(gedit:15508): Gtk-[1;35mCRITICAL[0m **: [34m12:30:21.061[0m: gtk_list_store_clear: assertion 'GTK_IS_LIST_STORE (list_store)' failed

(gedit:15508): Gtk-[1;35mCRITICAL[0m **: [34m12:30:21.061[0m: gtk_widget_set_visible: assertion 'GTK_IS_WIDGET (widget)' failed

(gedit:15508): Gtk-[1;35mCRITICAL[0m **: [34m12:30:21.061[0m: gtk_widget_set_visible: assertion 'GTK_IS_WIDGET (widget)' failed
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/2-hello$ gedit hel lo.cc

(gedit:15641): Gtk-[1;33mWARNING[0m **: [34m12:30:49.945[0m: Calling org.xfce.Session.Manager.Inhibit failed: GDBus.Error:org.freedesktop.DBus.Error.UnknownMethod: Method "Inhibit" with signature "susu" on interface "org.xfce.Session.Manager" doesn't exist

bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/2-hello$ ./[K[Kmake 
g++ -g -Wall -std=c++17    hello.cc   -o hello
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/2-hello$ /[K./j[Khello b art lisa
Hello Bart
Hello Lisa
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/2-hello$ ./hello 'lisa  simpson' 'bart simpson'
Hello Lisa  Simpson
Hello Bart Simpson
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/2-hello$ \[Kcd ..
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2$ cd 3-overload/
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/3-overload$ cd[K[Kmake
g++ -g -Wall -std=c++17    overload.cc   -o overload
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/3-overload$ run [K[K[K[Koverla [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K[K[K[K[K./over load
f(a) = 3; f(&a) = 4; f(a, b) = -1
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/3-overload$ gdb ov erload
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from overload...done.
(gdb) b f(int)*
Function "f(int)*" not defined.
Make breakpoint pending on future shared library load? (y or [n]) f([K[Kb f([K[K[K[Kn
(gdb) b f(int*)
Breakpoint 1 at 0x117d: file overload.cc, line 3.
(gdb) r
Starting program: /import/linux/home1/bmarti38/i240a/submit/lab2/3-overload/overload 

Breakpoint 1, f (a=0x7fffffffe678) at overload.cc:3
3	int f(int *a) { return *a * 2; }
(gdb) p a[K[K a
$1 = (int *) 0x7fffffffe678
(gdb) p *a
$2 = 2
(gdb) p *a = 5
$3 = 5
(gdb) c 
Continuing.
f(a) = 3; f(&a) = 10; f(a, b) = 2
[Inferior 1 (process 16329) exited normally]
(gdb) cd .[K[K[K[Kq
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2/3-overload$ cd ..
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2$ gi t[K[Kt add *
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2$ git p[Kci[Kommit -a -m  "lab2 complete"
[master 7432999] lab2 complete
 13 files changed, 255 insertions(+)
 create mode 100644 submit/lab2/1-hello/.gitignore
 create mode 100644 submit/lab2/1-hello/Makefile
 create mode 100644 submit/lab2/1-hello/README
 create mode 100644 submit/lab2/1-hello/hello.cc
 create mode 100644 submit/lab2/2-hello/.gitignore
 create mode 100644 submit/lab2/2-hello/Makefile
 create mode 100644 submit/lab2/2-hello/README
 create mode 100644 submit/lab2/2-hello/hello.cc
 create mode 100644 submit/lab2/3-overload/.gitignore
 create mode 100644 submit/lab2/3-overload/Makefile
 create mode 100644 submit/lab2/3-overload/overload.cc
 create mode 100644 submit/lab2/Makefile
 create mode 100644 submit/lab2/lab2.LOG
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2$ git push
Username for 'https://github.com': ben5168
Password for 'https://ben5168@github.com': 
remote: Invalid username or password.
fatal: Authentication failed for 'https://github.com/ben5168/i240a.git/'
bmarti38@g7-38:/import/linux/home1/bmarti38/i240a/submit/lab2$ git push
Username for 'https://github.com': ben5168
Password for 'https://ben5168@github.com': 
Enumerating objects: 20, done.
Counting objects:   5% (1/20)   Counting objects:  10% (2/20)   Counting objects:  15% (3/20)   Counting objects:  20% (4/20)   Counting objects:  25% (5/20)   Counting objects:  30% 